# Задание №4
# ✔ Создайте генератор чётных чисел от нуля до 100.
# ✔ Из последовательности исключите
# числа, сумма цифр которых равна 8.
# ✔ Решение в одну строку.

res = (i for i in range(2, 101, 2) if (i//10 + i%10) != 8)
print(*res)#2 4 6 10 12 14 16 18 20 22 24 28 30 32 34 36 38 40 42 46 48 50 52 54 56 58 60 64 66 68 70 72 74 76 78 82 84 86 88 90 92 94 96 98 100
